{
  "안녕": "안녕하세요! 무엇을 도와드릴까요?",
  "오늘 날씨 어때?": "지역마다 다르지만, 대체로 맑거나 흐릴 수 있어요.",
  "고마워": "언제든지요!",
  "마인크래프트 출시일": "Mojang Studios 에서 2009년 [30] 처음 발매한 샌드박스 형식의 비디오 게임. 이름처럼 채광 (Mine)과 제작 (Craft)을 하는 게임으로 흔히 알려져 있다.\n\n출처: https://namu.wiki/w/마인크래프트)",
  "firebase 이용법": "firebase init 작업은 로컬 프로젝트를 Firebase 프로젝트에 연결하기 위한 명령어입니다. ※ CLI 를 이용하기 위해서는 운영체제의 command line 명령어를 알아야 합니다.\n\n출처: https://velog.io/@angelo/Firebase-사용-방법)",
  "마인크래프트": "Minecraft는 나만의 세상을 만들고 탐험하고 살아남는 게임입니다. Minecraft 샌드박스, Minecraft Dungeons, Minecraft Legends, Minecraft Education 등 다양한 게임 모드와 컬렉션을 살펴보고, 최신 소식과 다운로드 정보를 확인하세요.\n\n출처: https://www.minecraft.net/ko-kr)",
  "파이썬 3": "How to verify your downloaded files are genuine Sigstore verification. Starting with the Python 3.\n\n출처: https://www.python.org/downloads/)",
  "닌텐도 스위치 2 스펙": "Joy-Con 2 의 C 버튼 및 본체 내장 마이크와 연동해 작동하는 시스템이다. 구형 조이콘 1이나 구형 프로 컨트롤러도 홈 버튼으로 C 버튼의 기능에 접근할 수 있어, 기존에 사용하던 오래된 컨트롤러도 스위치 2에서 사용 가능하다.\n\n출처: https://namu.wiki/w/Nintendo+Switch+2)",
  "random 모듈 사용법": "파이썬(Python)에서 난수를 만들기 위해서는 random 모듈을 사용해야 합니다. 이 랜덤 모듈에서 가장 많이 사용되는 함수(메소드)를 정리해봅니다.\n\n출처: https://withcoding.com/88)
  "학교의 학사 일정은 어떻게 되나요?": "학교의 학사 일정은 학사 일정표에서 확인할 수 있습니다. 일정표는 학교 홈페이지에서 제공됩니다.",
  "입학 절차와 조건은 무엇인가요?": "입학 절차는 온라인 지원 후 면접 또는 시험을 포함한 과정을 거칩니다. 자세한 사항은 입학처에서 확인해주세요.",
  "학교에 대한 자세한 소개를 알고 싶어요.": "학교에 대한 자세한 내용은 학교 소개 페이지에서 확인할 수 있습니다.",
  "기숙사 사용 가능 여부는 어떻게 되나요?": "기숙사는 제한된 인원만 사용할 수 있으며, 입소 희망자는 신청서를 제출해야 합니다.",
  "학교에서 제공하는 동아리 활동은 무엇이 있나요?": "학교에서는 다양한 동아리 활동을 제공하며, 각 학기마다 동아리 소개가 이루어집니다.",
  "학교 급식 메뉴는 어떻게 확인하나요?": "급식 메뉴는 학교 홈페이지 또는 각 학급에서 제공되는 급식 안내문을 통해 확인할 수 있습니다.",
  "학생회 활동에 참여하려면 어떻게 해야 하나요?": "학생회 활동은 선발 절차를 거쳐 참여할 수 있으며, 관련 공지가 있을 때 신청하면 됩니다.",
  "학교에서의 수업은 어떻게 진행되나요?": "수업은 전통적인 강의 방식과 함께 실습 및 프로젝트 기반 학습을 병행합니다.",
  "학기 중에 휴학을 할 수 있나요?": "휴학은 학교 규정에 따라 가능합니다. 자세한 사항은 학사팀에 문의해주세요.",
  "전학을 원할 때 절차는 어떻게 되나요?": "전학 절차는 전학 신청서 제출 후, 학교의 승인을 받는 절차를 포함합니다.",
  "장학금 제도는 어떻게 되나요?": "장학금은 성적 우수자 및 경제적 지원이 필요한 학생을 대상으로 제공됩니다. 자세한 정보는 장학금 담당 부서에서 확인하세요.",
  "학교에서 제공하는 교외 활동은 무엇이 있나요?": "학교에서는 다양한 교외 활동을 제공하며, 예술, 체육, 봉사활동 등을 포함합니다.",
  "체육대회나 문화 행사 일정은 언제인가요?": "체육대회 및 문화 행사는 매년 학기 중에 일정이 공지되며, 학교 일정표를 통해 확인할 수 있습니다.",
  "학교에 교통편은 어떻게 되나요?": "학교는 여러 대중교통 수단과 연결되어 있으며, 통학버스 서비스도 제공됩니다.",
  "학생들이 참여할 수 있는 봉사활동은 무엇이 있나요?": "학생들은 지역 사회 봉사 활동 및 학교에서 제공하는 봉사 프로그램에 참여할 수 있습니다.",
  "학교에서의 시험 일정은 어떻게 되나요?": "시험 일정은 학기 초에 공지되며, 학교 홈페이지나 학생 공지사항을 통해 확인할 수 있습니다.",
  "교사와 상담을 하고 싶으면 어떻게 해야 하나요?": "교사와 상담은 예약제로 진행되며, 상담 신청은 교무실을 통해 가능합니다.",
  "학교에서 지원하는 진로 상담 서비스가 있나요?": "진로 상담 서비스는 학생들에게 제공되며, 진로 관련 상담을 원하면 진로 상담실을 통해 신청할 수 있습니다.",
  "학교 홈페이지에서 자료를 어떻게 다운로드하나요?": "학교 홈페이지의 자료실에서 원하는 자료를 찾아 다운로드할 수 있습니다. 회원가입 후 접근이 가능합니다.",
  "학교에서 제공하는 외국어 교육은 어떤 것이 있나요?": "학교에서는 영어, 중국어, 일본어 등 다양한 외국어 수업을 제공합니다.",
  "수학 경시대회나 과학 경시대회는 언제 있나요?": "수학 및 과학 경시대회 일정은 매년 학기 초에 공지됩니다.",
  "학교에서 제공하는 방과후 프로그램은 무엇이 있나요?": "방과후 프로그램으로는 수학, 영어, 음악, 미술 등 다양한 선택 수업이 제공됩니다.",
  "학교 도서관은 어떻게 이용하나요?": "학교 도서관은 학생들이 자유롭게 책을 대출하고 열람할 수 있는 공간입니다. 대출은 학생증으로 가능합니다.",
  "학교에 주차 공간이 있나요?": "학교에는 학부모 및 교직원을 위한 주차 공간이 마련되어 있습니다.",
  "학교에서는 어떤 종교 활동을 지원하나요?": "학교는 종교적인 활동을 지원하지 않으며, 학생들에게 다양한 신념을 존중하는 교육을 제공합니다.",
  "학생이 학교에 결석할 때는 어떻게 해야 하나요?": "결석 시에는 보호자가 학교에 전화로 통보하고, 결석 사유서를 제출해야 합니다.",
  "졸업 후 대학 진학 지원은 어떻게 되나요?": "학교에서는 대학 진학을 위한 상담과 정보를 제공하며, 대학 입시를 준비하는 프로그램도 운영합니다.",
  "학교 행사에 부모님을 초대할 수 있나요?": "학교 행사에 부모님을 초대할 수 있으며, 행사 일정에 따라 초청장이 발송됩니다.",
  "학교에서 제공하는 심리 상담 서비스는 무엇이 있나요?": "학교에서는 학생들의 심리적 안정을 위해 전문 상담 교사를 통해 심리 상담 서비스를 제공합니다.",
  "학생들이 참여할 수 있는 학술 대회는 무엇이 있나요?": "학교에서는 학생들이 참여할 수 있는 다양한 학술 대회를 개최하며, 예선과 본선이 있습니다.",
  "학생이 학교를 떠날 때 필요한 절차는 무엇인가요?": "학교를 떠나기 위해서는 퇴학 절차에 따른 서류 제출과 승인 절차가 필요합니다.",
  "학교에서 제공하는 특별 활동 프로그램은 무엇인가요?": "학교에서는 특별활동으로 음악, 미술, 체육 등 다양한 분야의 프로그램을 제공합니다.",
  "학생들이 실습할 수 있는 시설은 무엇이 있나요?": "학교에는 실습실, 체육관, 미술실 등 다양한 실습 시설이 갖추어져 있습니다.",
  "학교에서 진행하는 연극이나 공연은 언제 있나요?": "학교에서는 매년 연극과 문화 공연을 진행하며, 공연 일정은 학교 홈페이지에서 확인할 수 있습니다.",
  "학교에서의 안전 관리 정책은 어떻게 되나요?": "학교는 학생들의 안전을 위해 안전 교육을 진행하고, 각종 비상 대책을 마련해 두고 있습니다.",
  "학교에서 제공하는 취업 지원 서비스는 무엇이 있나요?": "학교에서는 취업을 위한 정보 제공 및 취업 박람회를 개최하며, 취업 상담 서비스를 제공합니다.",
  "학교에서 여행이나 소풍은 언제 가나요?": "학교는 매년 정기적인 소풍과 야외 활동을 진행하며, 일정은 사전에 공지됩니다.",
  "학교에서 수학과학 경진대회 외에 어떤 대회를 진행하나요?": "학교에서는 수학, 과학, 문학, 예술 분야의 다양한 대회를 진행하고, 각 대회에 대한 정보는 학교 공지사항을 통해 제공됩니다.",
  "학생들이 사용 가능한 컴퓨터실은 어떻게 이용하나요?": "학교의 컴퓨터실은 학생들이 수업을 보조하거나 개인 학습을 위해 예약제로 이용할 수 있습니다.",
}
